<?php
// +----------------------------------------------------------------------
// | Niucloud-admin 企业快速开发的saas管理平台
// +----------------------------------------------------------------------
// | 官方网址：https://www.niucloud-admin.com
// +----------------------------------------------------------------------
// | niucloud团队 版权所有 开源版本可自由商用
// +----------------------------------------------------------------------
// | Author: Niucloud Team
// +----------------------------------------------------------------------

namespace app\listener\site;


/**
 * 添加站点成功后事件
 */
class AddSiteAfterListener
{
    /**
     * 初始化站点
     * @param array $params
     */
    public function handle($params = [])
    {
    }
}
